#+TITLE: April 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-04-06 Sat>
  :wpd-akshay196: 1
  :wpd-gandalfdwite: 2
  :wpd-jasonbraganza: 3
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 1
  :END:
** akshay196
*** The Hitchhiker's guide to Python - Part II [0/4]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1553004553
    :TASKID: READ.1553004553
    :END:
     - [ ] Chapter 8. Code Management and Improvement  ( 5h)
       - Continuous Integration
       - System Administration
       - Speed
     - [ ] Chapter 9. Software Interface               ( 3h)
       - Web clients
       - Data Serialization
       - Disributed Systems
       - Cryptography
     - [ ] Chapter 10. Data Manipulation               ( 2h)
       - Scientific Applications
       - Text Manipulation and Text Mining
     - [ ] Chapter 11. Data Persistence                ( 3h)
       - Structured Files
       - Database Libraries

** gandalfdwite
*** Read Kubernetes Docs
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   3.75
   :OWNER: gandalfdwite
   :ID: READ.1554610265
   :TASKID: READ.1554610265
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-11 Thu 21:12]--[2019-04-11 Thu 22:36] =>  1:24
   CLOCK: [2019-04-10 Wed 22:16]--[2019-04-10 Wed 22:43] =>  0:27
   CLOCK: [2019-04-09 Tue 22:08]--[2019-04-09 Tue 22:50] =>  0:42
   CLOCK: [2019-04-09 Tue 09:57]--[2019-04-09 Tue 10:31] =>  0:34
   CLOCK: [2019-04-08 Mon 20:04]--[2019-04-08 Mon 20:42] =>  0:38
   :END:
   - [X] Kubernetes Overview                      ( 2h)
   - [ ] Kubernetes Architecture                  ( 2h)
   - [ ] Containers                               ( 2h)
   - [ ] Workloads                                ( 1h)
   - [ ] Services, Load Balancing, Networking     ( 3h)
*** Learn dgplug logs
   :PROPERTIES:
   :ESTIMATED: 7
   :ACTUAL:   2.68
   :OWNER: gandalfdwite
   :ID: READ.1554610334
   :TASKID: READ.1554610334
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-11 Thu 18:22]--[2019-04-11 Thu 20:22] =>  2:00
   CLOCK: [2019-04-09 Tue 18:50]--[2019-04-09 Tue 19:31] =>  0:41
   :END:
     - [ ] Part 3. Search Functions      ( 1h)
     - [ ] Part 4. Shell mode commands   ( 1h)
     - [ ] Part 5. Dired mode            ( 1h)
     - [X] Part 6. Info Commands         ( 1h)
     - [ ] Part 7. Calculator in emacs   ( 1h)
     - [X] Part 8. Org mode in emacs     ( 2h)
*** Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi)
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1554610422
   :TASKID: READ.1554610422
   :END:
    - [ ] 1. Introduction                      ( 2h)
    - [ ] 2. Recursion & Backtracking          ( 1h)
    - [ ] 3. Linked Lists                      ( 1h)
    - [ ] 4. Stacks                            ( 1h)

** jasonbraganza
*** IN_PROGRESS NIOS Maths Text Book - Part V [0/7]
   :PROPERTIES:
   :ESTIMATED: 39
   :ACTUAL:   5.95
   :OWNER: jasonbraganza
   :ID: READ.1552291497
   :TASKID: READ.1552291497
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-08 Mon 10:00]--[2019-04-08 Mon 12:53] =>  2:53
   CLOCK: [2019-04-07 Sun 14:44]--[2019-04-07 Sun 16:25] =>  1:41
   CLOCK: [2019-04-07 Sun 11:46]--[2019-04-07 Sun 13:09] =>  1:23
   :END:
    - [-] Module - IV: Co-ordinate Geometry [1/4]
      - [X] 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 14 - Straight Lines
      - [ ] 15 - Circles
      - [ ] 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 17 - Measures of Dispersion
      - [ ] 18 - Random Experiments and Events
      - [ ] 19 - Probability
    - [ ] Module - VI: Algebra II [0/3]
      - [ ] 20 - Matrices
      - [ ] 21 - Determinants
      - [ ] 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 23 - Relations and Functions II
      - [ ] 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 25 -  Limits and Continuity
      - [ ] 26 - Differentiation
      - [ ] 27 - Differentiation of Trigonometric Functions
      - [ ] 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 29 - Application of Derivatives
      - [ ] 30 - Integration
      - [ ] 31 - Definite Integrals
      - [ ] 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 33 - Introduction to Three Dimensional Geometry
      - [ ] 34 - Vectors
      - [ ] 35 - Plane
      - [ ] 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 37 - Linear Programming
      - [ ] 38 - Mathematical Reasoning
** sandeepk
*** IN_PROGRESS Stacknews [0/3]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   1.58
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-09 Tue 23:00]--[2019-04-09 Tue 23:40] =>  0:40
    CLOCK: [2019-04-08 Mon 22:10]--[2019-04-08 Mon 23:05] =>  0:55
    :END:
    - [ ] Design/CSS work for the landing page, Login page, Post submit page (5h)
    - [ ] Logic for comment on post and tab (2h) 
    - [ ] Logic for thread post linkage (2h)
*** IN_PROGRESS Sapiens Book Reading [1/14]
    :PROPERTIES:
    :ESTIMATED: 6.5
    :ACTUAL:   1.33
    :OWNER: sandeepk
    :ID: READ.1554403369
    :TASKID: READ.1554403369
    :END:
    :LOGBOOK:
    CLOCK: [2019-04-11 Thu 00:15]--[2019-04-11 Thu 00:55] =>  0:40
    CLOCK: [2019-04-08 Mon 23:15]--[2019-04-08 Mon 23:30] =>  0:15
    CLOCK: [2019-04-07 Sun 22:10]--[2019-04-07 Sun 22:25] =>  0:15
    CLOCK: [2019-04-06 Sat 17:10]--[2019-04-06 Sat 17:20] =>  0:10
    :END:
    - [X] History's Biggest Fraud (30m)
    - [ ] Building Pyramids (25m)
    - [ ] Memory Overload (20m)
    - [ ] There is No Justice in History (35m)
    - [ ] The Arrow of History (15m)
    - [ ] The Scent of Money (20m)
    - [ ] Imperial Visions (25m)
    - [ ] The Law of Religion (35m)
    - [ ] The Secret of Success (15m)
    - [ ] The Discovery of Ignorance (35m)
    - [ ] The Marriage of Science and Empire (40m)
    - [ ] The Capitalist Creed (35m)
    - [ ] The Wheels of Industry (30m)
    - [ ] A Permanent Revolution (30m)

** sidntrivedi
*** TODO Learn Javascript [0/5]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1554709767
   :TASKID: READ.1554709767
   :END:
   - [ ] ES6
   - [ ] Regular Expressions
   - [ ] Debugging
   - [ ] Basic Data Structures
   - [ ] Basic ALgorithm Scripting
*** TODO Read Linux for you and me [0/4]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1554709804
   :TASKID: READ.1554709804
   :END:
   - [ ] File Permissions
   - [ ] Processes in Linux
   - [ ] Linux Services
   - [ ] Package Management
*** TODO Blog [0/1]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: WRITE.1539072660
    :TASKID: WRITE.1539072660
    :END:      
    - [ ] Write one blog on ES6 features.
